; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared2 - mode
	spectrograph4 - mode
	thermograph3 - mode
	thermograph0 - mode
	infrared5 - mode
	image1 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation3 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared5)
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph4)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Planet10 infrared5)
	(have_image Phenomenon11 spectrograph4)
	(have_image Star12 infrared2)
	(have_image Planet13 image1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 5
3. (turn_to satellite0 phenomenon11 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 5
4. (take_image satellite0 phenomenon11 instrument0 spectrograph4)
   added: (have_image phenomenon11 spectrograph4)
   goals met: 1 of 5
5. (turn_to satellite0 planet10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet10)
   goals met: 1 of 5
6. (take_image satellite0 planet10 instrument0 infrared5)
   added: (have_image planet10 infrared5)
   goals met: 2 of 5
7. (turn_to satellite0 planet13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet13)
   goals met: 2 of 5
8. (take_image satellite0 planet13 instrument0 image1)
   added: (have_image planet13 image1)
   goals met: 3 of 5
9. (turn_to satellite0 star12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 star12)
   goals met: 3 of 5
10. (take_image satellite0 star12 instrument0 infrared2)
   added: (have_image star12 infrared2)
   goals met: 4 of 5
11. (turn_to satellite0 star6 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star6)
   goals met: 5 of 5
